/*
 Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

0, 7, 8, -2, -2 -> 2

1, -7, 567, 89, 223-> 3
*/



    // Console.WriteLine("enter number :");
    // double EnteredText = int.Parse(Console.ReadLine());
    // string EndedText = "end";
    // Console.WriteLine(EnteredText+100);



// while (EnteredText != EndedText);
// {
//     if (EnteredText == )
//     {
        
//     }

// }
